importing pandas

In [6]:
#this is importing the pandas
import pandas as pd

In [7]:
pd.DataFrame({'Yes':[50,21],'No':[131,2]})

   Yes   No
0   50  131
1   21    2

In [8]:
Dataset=pd.read_csv("data.csv")

In [9]:
Dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [10]:
Dataset.shape

(10, 4)

In [11]:
Dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [12]:
Dataset['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [13]:
Dataset['Country'][0]

'France'

In [14]:
Dataset['Country'][0:3]

0     France
1      Spain
2    Germany
Name: Country, dtype: object

In [15]:
Dataset.Country=='Germany'

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8     True
9    False
Name: Country, dtype: bool

In [16]:
Germany_Column = Dataset.loc[Dataset.Country=="Germany"]

In [22]:
Dataset.loc[Dataset.Country=="Germany"]

   Country   Age   Salary Purchased    salary
2  Germany  30.0  54000.0        No  250000.0
4  Germany  40.0      NaN       Yes       NaN
8  Germany  50.0  83000.0        No       NaN

In [23]:
Germany_Column

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [24]:
Germany_Column. to_csv('GermanyData.csv')

In [26]:
Dataset.loc[Dataset.Salary.isnull()]

   Country   Age  Salary Purchased  salary
4  Germany  40.0     NaN       Yes     NaN

In [27]:
Dataset.loc[Dataset.Salary.notnull()]

   Country   Age   Salary Purchased    salary
0   France  44.0  72000.0        No       NaN
1    Spain  27.0  48000.0       Yes       NaN
2  Germany  30.0  54000.0        No  250000.0
3    Spain  38.0  61000.0        No       NaN
5   France  35.0  58000.0       Yes       NaN
6    Spain   NaN  52000.0        No       NaN
7   France  48.0  79000.0       Yes       NaN
8  Germany  50.0  83000.0        No       NaN
9   France  37.0  67000.0       Yes       NaN

In [28]:
Dataset['Salary'] = 1000

In [29]:
Dataset

   Country   Age  Salary Purchased    salary
0   France  44.0    1000        No       NaN
1    Spain  27.0    1000       Yes       NaN
2  Germany  30.0    1000        No  250000.0
3    Spain  38.0    1000        No       NaN
4  Germany  40.0    1000       Yes       NaN
5   France  35.0    1000       Yes       NaN
6    Spain   NaN    1000        No       NaN
7   France  48.0    1000       Yes       NaN
8  Germany  50.0    1000        No       NaN
9   France  37.0    1000       Yes       NaN

In [30]:
Dataset.Salary.describe()

count      10.0
mean     1000.0
std         0.0
min      1000.0
25%      1000.0
50%      1000.0
75%      1000.0
max      1000.0
Name: Salary, dtype: float64

In [32]:
Dataset.Salary.unique()

array([1000], dtype=int64)

In [33]:
Dataset.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)